fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ ВКМ
	ВКМ_СоздатьЭлементыАбонентскогоОбслуживания();
	ВКМ_УстановитьВидимостьАбонентскогоОбслуживанияНаСервере();
	//-- ВКМ
	
КонецПроцедуры
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	//++ ВКМ
	ВКМ_УстановитьВидимостьАбонентскогоОбслуживанияНаСервере();
	//-- ВКМ
	
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВКМ_УстановитьВидимостьАбонентскогоОбслуживания();
	
КонецПроцедуры
#КонецОбласти
#Область ВКМ_СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВКМ_СоздатьЭлементыАбонентскогоОбслуживания()
	

	Родитель = Элементы.ВКМ_ГруппаАбонентскогоОбслуживания;
	Если Элементы.Найти("ВКМ_ДатаНачалаДействия") = Неопределено Тогда
		Элемент = Элементы.Добавить("ВКМ_ДатаНачалаДействия", Тип("ПолеФормы"), Родитель);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействия";
		Элемент.Заголовок = НСтр("ru = 'Дата начала действия'");
	КонецЕсли;
	Если Элементы.Найти("ВКМ_ДатаОкончанияДействия") = Неопределено Тогда
		Элемент = Элементы.Добавить("ВКМ_ДатаОкончанияДействия", Тип("ПолеФормы"), Родитель);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействия";
		Элемент.Заголовок = НСтр("ru = 'Дата окончания действия'");
	КонецЕсли;
	Если Элементы.Найти("ВКМ_СуммаАбонентскойПлаты") = Неопределено Тогда
		Элемент = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"), Родитель);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
		Элемент.Заголовок = НСтр("ru = 'Сумма абонентской платы'");
	КонецЕсли;
	Если Элементы.Найти("ВКМ_СтоимостьЧасаРаботы") = Неопределено Тогда
		Элемент = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"), Родитель);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		Элемент.Заголовок = НСтр("ru = 'Стоимость часа работы'");
	КонецЕсли;

	
КонецПроцедуры
&НаКлиенте
Процедура ВКМ_УстановитьВидимостьАбонентскогоОбслуживания()
	
	ВКМ_УстановитьВидимостьАбонентскогоОбслуживанияНаСервере();
	
КонецПроцедуры
&НаСервере
Процедура ВКМ_УстановитьВидимостьАбонентскогоОбслуживанияНаСервере()
	
	Видимость = Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание;
	Если Элементы.Найти("ВКМ_ГруппаАбонентскогоОбслуживания") <> Неопределено Тогда
		Элементы.ВКМ_ГруппаАбонентскогоОбслуживания.Видимость = Видимость;
	КонецЕсли;
	Если Элементы.Найти("ВКМ_ДатаНачалаДействия") <> Неопределено Тогда
		Элементы.ВКМ_ДатаНачалаДействия.Видимость = Видимость;
	КонецЕсли;
	Если Элементы.Найти("ВКМ_ДатаОкончанияДействия") <> Неопределено Тогда
		Элементы.ВКМ_ДатаОкончанияДействия.Видимость = Видимость;
	КонецЕсли;
	Если Элементы.Найти("ВКМ_СуммаАбонентскойПлаты") <> Неопределено Тогда
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Видимость;
	КонецЕсли;
	Если Элементы.Найти("ВКМ_СтоимостьЧасаРаботы") <> Неопределено Тогда
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Видимость;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
